{"Id":0,"Title":"Создать макет главное страницы","LessonPart":[{"LessonNumber":2,"Title":"Введение","Type":"content","Tags":"","Tech":"","Experience":"0","Comment":"todo картинка работы","Description":[{"PageNumber":1,"Content":"Нам поступил заказ сделать сайт для сети ресторанов\nПример того что должно получиться в конце, смотри как круто.\nTODO пример картинка\nА ты наш новый сотрудник. Приступай скорее!"},{"PageNumber":2,"Content":"Вводное видео\ntagvideo src http://youtube.com/46464tdgdg endvideo"}],"Tutorial":[{"PageNumber":1,"Content":"**"}],"Job":[{"PageNumber":1,"Content":"***"}],"DescriptionText":""},{"LessonNumber":3,"Title":"Настройка окружения","Type":"task","Tags":"git, html, terminal","Tech":"git.clone, git.add, git.commit, git.push, terminal","Experience":"10","Comment":"Эта задача по установке гита может универсальной для других направлений.\nДобавление нового тега гит. Акцентировать. Поздравляем, вы добавили новый тег в свое резюме. Конечно вы не стали профессионалом в гит, но вы можете смело сказать на собеседовании, что работали с ним и имеете педставление. То есть честно добавили его.\nTODO: или показывать добавлять тег в резюме при наборе нескольких тегов из уроков: например 10 тегов набираешь, тогда он идет в резюме.","Description":[{"PageNumber":1,"Content":"Вы пришли на работу, с чего вы начнете? Конечно с настройки рабочей среды. Так и у нас.\nПодготавливаем среду, ставим гит.\nВ качетстве редактора можно использовавать: sublime text 2 \nТебе нужно создать репозиторий на github.com, запушить туда один файл, например readme. И сохранить ссылку в задаче."},{"PageNumber":2,"Content":"Регистрируемся на github если у вас еще нет аккаунта, по умолчанию все репозитории публичные на бесплатном тарифе. Нам этого достаточно.\nGithub это один самых популярных свободных гит репозиторев. Туда вы сможете сохранять свои проекты, через гитхаб я буду смотреть твою работу и подсказывать.\nПроцесс такой: ты загружаешь код на гитхаб, он сохраняется там, а я могу взять его себе.\nTodo картинка\nДавай сразу пользоваться консолью, у нас тут так принято и это круто! С точки зрения использования это самый удобный способ работы. Теперь давай по шагам:\nУстановка гит с сайта gitscm\n     Открой командную строку и набери команду git help. Должно быть примерно так.\nРегистрация на github.org\nСоздайте проект 'CstRestaurant'\nСклонировать проект на свой компьютер командой clone\nДобавить файлы\nДобавить add командой новый файл (добавить в index)\nЗакоммитить изменения, в данном случае один новый файл\nПуш\nGit push origin master"},{"PageNumber":3,"Content":"Запомни, пока для работы нам хватит следующего:\n1. Создал или отредактировал файл\n2. Сделал им git add\n3. Сделал git commit -m 'message'\n4. Запушил на гитхаб git push origin master\nЭтого достаточнодля начала работы. Всегда сможешь вернуться и посмотреть эти подсказки\n\nLinks: http://git-scm.ru"}],"Tutorial":[{"PageNumber":1,"Content":"**"}],"Job":[{"PageNumber":1,"Content":"***"}],"DescriptionText":""},{"LessonNumber":4,"Title":"тестовая глава","Type":"","Tags":"","Tech":"","Experience":"0","Comment":"","Description":[{"PageNumber":1,"Content":"текст втт"}],"Tutorial":[{"PageNumber":1,"Content":"**"}],"Job":[{"PageNumber":1,"Content":"***"}],"DescriptionText":"описание"}]}